In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [2]:
n_rows =5
n_cols= 2

cols = ['omset', 'operasional']
df=pd.DataFrame(np.random.randint(1,20, size=(n_rows,n_cols)), columns = cols)

df

   omset  operasional
0      8            5
1      6           11
2      5           18
3     13            4
4     15            4

In [3]:
df['omset'] = df['omset'] *100_000 #tanda underlinemerupakan digital flasholder
df['operasional'] = df['operasional'] *10_000
df

     omset  operasional
0   800000        50000
1   600000       110000
2   500000       180000
3  1300000        40000
4  1500000        40000

In [4]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq = 'D') #D karena daily
df = df.reset_index() #Untuk menjadikan indeks saat ini yaitu indeks date time menjadi sebuah kolom biasa dengan nama indeks
df = df.rename(columns = {'index':'tanggal'})
df

C:\Users\AC\anaconda3\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

     tanggal    omset  operasional
0 2000-01-01   800000        50000
1 2000-01-02   600000       110000
2 2000-01-03   500000       180000
3 2000-01-04  1300000        40000
4 2000-01-05  1500000        40000

In [5]:
#Melakukan Formatting Tampilan Data Frame

formatku = {'tanggal' : '{:%d/%m/%y}', #format hari, bulan, dan tahun
            'operasional' : 'Rp{:.2f}', #untuk memberi 2 digit ekstra di belakang koma
            'omset' : 'Rp{:.2f}'}
laporan = df.style.format(formatku)
laporan
#tanggal, operasional, dan omset berfungsi untuk memberi nama kolom

In [6]:
type(laporan) #bukan object Data Frame tetapi Styler
#object Styler beda dengan object Data Frame

pandas.io.formats.style.Styler

In [7]:
laporan.hide_index() #Berfungsi untuk menyembunyikan index

In [8]:
laporan.set_caption('Data Omset dan Operasional') #Berrfungsi untuk menambahkan judul

In [9]:
#Memberi warna/highlight 
laporan.highlight_min('omset', color = 'pink')
laporan.highlight_max('omset', color = 'lightgreen')

laporan.highlight_min('operasional', color = 'lightblue')
laporan.highlight_max('operasional', color = 'grey')